local eminence_definitions = {}

eminence_definitions.missions = {
    [0] = { label = "デストリアキャップ", message = "チュートリアルをクリアした", reward = "デストリアキャップ、チョコボシャツ" },
    [1] = { label = "フェイス上限＋１", message = "初めてミッションランクが３になる", reward = "呼び出せるフェイスの上限数1体アップ" },
    [2] = { label = "フェイス上限＋１", message = "初めてミッションランクが４になる", reward = "呼び出せるフェイスの上限数1体アップ" },
    [3] = { label = "フェイスレベル＋１", message = "初めてミッションランクが５になる", reward = "フェイスレベルがプレイヤーのレベルに＋１される" },
    [4] = { label = "フェイスレベル＋１", message = "ジラートミッションをクリアした", reward = "フェイスレベルがプレイヤーのレベルに＋１される" },
    [5] = { label = "種族別水着", message = "プロマシアミッション「みっつの道」をクリア", reward = "エンチャント:テレポ（プルゴノルゴ島）付属の装備" },
    [6] = { label = "フェイスレベル＋１", message = "プロマシアミッションをクリアした", reward = "フェイスレベルがプレイヤーのレベルに＋１される" },
    [7] = { label = "フェイスレベル＋１", message = "アトルガンミッションをクリアした", reward = "フェイスレベルがプレイヤーのレベルに＋１される" },
}

eminence_definitions.faces = {
    [0] = { label = "アーデルハイト", message = "サンドリアのフェイス使用許可証を入手する", reward = "フェイス「アーデルハイト」" },
    [1] = { label = "ミリ・アリアポー", message = "バストゥークのフェイス使用許可証を入手する", reward = "フェイス「ミリ・アリアポー」" },
    [2] = { label = "ヴァレンラール", message = "ウィンダスのフェイス使用許可証を入手する", reward = "フェイス「ヴァレンラール」" },
    [3] = { label = "コルモル", message = "クエスト「錬金術の実験」をクリアする", reward = "フェイス「コルモル」" },
    [4] = { label = "アークHM", message = "ジラートミッションで無知のかけらを入手する", reward = "フェイス「アークHM」" },
    [5] = { label = "アークEV", message = "ジラートミッションで驕慢のかけらを入手する", reward = "フェイス「アークEV」" },
    [6] = { label = "アークMR", message = "ジラートミッションで怯懦のかけらを入手する", reward = "フェイス「アークMR」" },
    [7] = { label = "アークTT", message = "ジラートミッションで嫉妬のかけらを入手する", reward = "フェイス「アークTT」" },
    [8] = { label = "アークGK", message = "ジラートミッションで憎悪のかけらを入手する", reward = "フェイス「アークGK」" },
    [9] = { label = "モンブロー", message = "プロマシアミッション烙印ありてをクリアする", reward = "フェイス「モンブロー」" },
}

return eminence_definitions
